[
  {
    "id": "",
    "defaultGroupsize": 4,
    "name": "Spaghetti Bolognese",
    "duration": 30,
    "categories": [],
    "instructions": [
      "Eine tiefe Pfanne wird empfohlen. Zwiebeln kleinwürfeln und in Öl ein wenig anbraten. Das Hackfleisch dazugeben und schön anbraten.",
      "Mit Pfeffer, Salz, Pizzegewürz (oder eben andere Kräuter wie Basilikum, Majoran, etc.) würzen und dann mit den diversen Formen der Tomaten und etwas Wasser gut zusammenrühren.",
      "Nun die Nudeln aufsetzen, so dass die Soße auf mittlerer Hitze gut durchziehen kann. Fertig.",
      "Die Tomatensachen können nach Lust und Verfügbarkeit variiert werden. Geheimtipp: Zum Würzen etwas Worchester Soße nutzen."
    ],
    "ingredients": [
      {
        "name": "Zwiebeln",
        "amount": {
          "min": 1,
          "max": 2
        },
        "unit": "PIECE"
      },
      {
        "name": "(Rinder) Hackfleisch",
        "amount": 500,
        "unit": "GRAMS"
      },
      {
        "name": "Tomatenmark",
        "amount": 0.5,
        "unit": "TUBE"
      },
      {
        "name": "Passierte Tomaten",
        "amount": 1,
        "unit": "PACK"
      },
      {
        "name": "Gehackte Tomaten",
        "amount": 1,
        "unit": "CAN"
      },
      {
        "name": "Spaghetti",
        "amount": 0.5,
        "unit": "PACK"
      },
      {
        "name": "geribener Käse/Parmesan (nach Belieben)",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "Pfannkuchen",
    "duration": 10,
    "categories": [],
    "instructions": [
      "Die Eier mit dem Zucker cremig aufschlagen, dann mit der Milch verrühren. Nun Salz, Mehl und Backpulver dazugeben und alles zu einem glatten Teig rühren.",
      "Danach den Teig für ca. 15 Minuten ruhen lassen, da das Mehl noch ausquillt. Dann 1-2 große Schöpfkellen Teig in eine auf mittlere Hitze erhitzte, beschichtete Pfanne geben.",
      "Nach ca. 2 Minuten bilden sich kleine Bläschen, dann den Pfannkuchen einmal wenden und von der anderen Seite schön goldbraun ausbacken. "
    ],
    "ingredients": [
      {
        "name": "Eier",
        "amount": 4,
        "unit": "PIECE"
      },
      {
        "name": "Zucker",
        "amount": 2,
        "unit": "TABLESPOON"
      },
      {
        "name": "Milch",
        "amount": 400,
        "unit": "MILLILITER"
      },
      {
        "name": "Salz",
        "amount": 1,
        "unit": "PINCH"
      },
      {
        "name": "Mehl",
        "amount": 200,
        "unit": "GRAMS"
      },
      {
        "name": "Backpulver",
        "amount": 1,
        "unit": "MSP"
      },
      {
        "name": "Öl, zum Braten",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "Kartoffel-gemüsesuppe mit opt. Wursteinlage",
    "duration": 30,
    "categories": [],
    "instructions": [
      "Kartoffeln schälen, vierteln oder kleiner (je kleiner, desto schneller werden sie gar!). Weiteres Gemüse (z.B. Karotten, Lauch, Sellerie, Zwiebeln, etc), kleinschneiden und ebenfalls dazu geben.",
      "Mit Wasser bis knapp über die Füllhöhe auffüllen, das ganze mit Gemüsebrühe würzen und aufkochen, bis die Kartoffeln weich sind (ca. 20 Minuten). Alles mit dem Pürierstab passieren.",
      "Die Wurst in Scheiben schneiden, zur Suppe dazugeben und ein paar Minuten warm werden lassen. Mit Gemüsebrühe, Salz, Pfeffer, Maggi, etc. abschmecken.",
      "Das Rezept ist sehr flexibel, man kann das Gemüse variieren, z.B. mehr Karotten, Kürbis, Pastinaken, etc."
    ],
    "ingredients": [
      {
        "name": "Kartoffeln (mehlig)",
        "amount": 500,
        "unit": "GRAMS"
      },
      {
        "name": "Gemüse, div. (z.B. Karotten, Lauch, Sellerie, etc)",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Gemüsebrühe",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Wurst (z.B. Cabanossi, Krakauer, Bauernmettwurst)",
        "amount": 100,
        "unit": "GRAMS"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "UMAMI-Burger",
    "duration": 30,
    "categories": [],
    "instructions": [
      "Die Zwiebel, den Knoblauch und die Ingwerknolle kleinhacken (alternativ nur mit Ingwer würzen). Das Hackfleisch mit der Zwiebel, dem Ingwer, dem Eigelb, dem Steakpfeffer, der Soja Sauße und dem Parmesan zusammen in eine Schüssel geben und miteinander vermengen.",
      "Aus der resultierenden Masse zwei Burgerpattys formen (alternativ zu kompakten Kugeln rollen und dann in der Pfanne klein drücken).",
      "Aus der Tomate zwei große Scheiben herausschneiden und diese mit dem Zucker/Honig/Agavendicksaft großzügig bestreichen. Mit der Zuckerseite nach unten in der Pfanne auf mittlerer Hitze (mit Öl) etwas anbraten.",
      "Währenddessen die Fleischpatties in der Pfanne anbraten. Nicht zu scharf, lieber etwas Zeit lassen. Die Tomate gelegentlich wenden und rechtzeitig aus der Pfanne nehmen, sonst verbrennt man sich die Zunge.",
      "Empfehlung: Brioche Brötchen als Burgerbrötchen nutzen. Diese in der Pfanne mit anbraten.",
      "Die Unterseite der Brötchen mit Kresse belegen, darauf die Karamelisierte Tomatenscheibe und darauf dann das Fleisch. Wer es mag kann darauf dann noch dünne Gewürzgurkenscheiben legen. Mit dem oberen Teil des Brötchens beenden.",
      "Wichtig: keine sonstigen Soßen oder sonst irgendwas auf den Bruger mit drauf!"
    ],
    "ingredients": [
      {
        "name": "mageres Rinderhackfleisch",
        "amount": 250,
        "unit": "GRAMS"
      },
      {
        "name": "Zwiebel",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Ingwer",
        "amount": 0.5,
        "unit": "PIECE"
      },
      {
        "name": "große Tomate (Fleischtomate)",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Eigelb",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Parmesan, gerieben",
        "amount": {
          "min": 1.5,
          "max": 2
        },
        "unit": "TABLESPOON"
      },
      {
        "name": "Soja Sauße",
        "amount": 1,
        "unit": "TABLESPOON"
      },
      {
        "name": "Knoblauch",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Brunnen-/Radieschenkresse",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Knoblauch",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Gewürzgurken",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Soja Sauße",
        "amount": 1.5,
        "unit": "TABLESPOON"
      },
      {
        "name": "Steakpfeffer",
        "amount": 1,
        "unit": "TABLESPOON"
      },
      {
        "name": "Zucker/Honig/Agavendicksaft",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Olivenöl zum Anbraten",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 6,
    "name": "Brioche (Burger-)Brötchen",
    "duration": 60,
    "categories": [],
    "instructions": [
      "Die Milch mit der Butter und dem Zucker in einem Topf leicht erwärmen, so dass die Butter schmilzt (nicht über 35°C werden lassen, also handwarm. Wenn sie doch wärmer wird, abkühlen lassen bevor es mit der Hefe vermischt wird).",
      "Die Hefe, die Hälfte des Mehls, das Salz und die Milch-Butter-Zucker Mischung in einer Schüssel zusammenmischen und geschmeidig verbinden. Entweder mit den Fingern oder mit dem Rührgerät.",
      "Das Ei in einer kleinen Schüssel verrühren und ungefähr die Hälfte davon in die große Schüssel dazu geben. Dann nach und nach mit dem restlichen Mehl vermischen.",
      "Den Teig jetzt 10-15 Minuten kräftig durchkneten, bis er nicht mehr klebrig ist sondern eher glatt und geschmeidig. Den Teig in 6 Teile aufteilen (ca. 80-100g pro Brötchen), in eine Kugel formen und auf einem Backrost mit Backpapier auslegen.",
      "Die Brötchen 30 Minuten an einem warmen Ort gehen lassen.",
      "Nach Belieben: Mit dem restlichen Ei bestreichen und mit Sesam bestreuen. 12-15 Minuten bei 200° Ober-Unterhitze im vorgeheizten Backofen backen."
    ],
    "ingredients": [
      {
        "name": "Mehl",
        "amount": 330,
        "unit": "GRAMS"
      },
      {
        "name": "Milch (3,5% oder mehr)",
        "amount": 150,
        "unit": "MILLILITER"
      },
      {
        "name": "Butter",
        "amount": 40,
        "unit": "GRAMS"
      },
      {
        "name": "Zucker",
        "amount": 15,
        "unit": "GRAMS"
      },
      {
        "name": "Salz",
        "amount": 5,
        "unit": "GRAMS"
      },
      {
        "name": "Ei",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "(frische) Hefewürfel",
        "amount": 0.5,
        "unit": "PACK"
      },
      {
        "name": "(Sesam)",
        "amount": null,
        "unit": "NONE",
        "optional": true
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 1,
    "name": "Hefezopf",
    "duration": 60,
    "categories": [],
    "instructions": [
      "Die Milch in einem kleinen Topf lauwarm werden lassen. Die Hefe in 3-4 EL dieser lauwarmen Milch und 1 TL Zucker auflösen. Das Mehl in eine Schüssel geben, darin die Hefe in eine Vertiefung geben. Die Hefe mit einem TL und Mehl andicken. Mit einem Handtuch abdecken und 15 Minuten gehen lassen.",
      "In der Zwischenzeit die Butter in der Milch auflösen. Darauf achten, dass die Milch nicht zu warm wird. Die nun aufgegangene Hefe mit etwas Mehl bedecken, die restlichen Zutaten hinzugeben und alles für 5 Minuten gut durchkneten. Nach Bedarf noch etwas Mehl nachgeben, der Teig darf aber gerne noch etwas klebrig sein. Ca. 45 Minuten mit einem Küchenhandtuch abgedeckt gehen lassen.",
      "Den Teig nochmal kurz durchkneten, dann nach Wunsch Formen und Dekorieren, z.B. in einen Zopf flechten. Wenn noch etwas (lauwarme) Milch übrig ist, kann man den Zopf damit bestreichen, das gibt eine schöne Farbe (und bietet eine gute Grundlage für Bestreuung mit z.B. Hagelzucker). Im vorgeheizten Backofen bei 200° Ober-Unterhitze 20-30 Minuten backen."
    ],
    "ingredients": [
      {
        "name": "Mehl",
        "amount": 750,
        "unit": "GRAMS"
      },
      {
        "name": "Milch",
        "amount": 375,
        "unit": "MILLILITER"
      },
      {
        "name": "Butter",
        "amount": 100,
        "unit": "GRAMS"
      },
      {
        "name": "Zucker",
        "amount": 125,
        "unit": "GRAMS"
      },
      {
        "name": "Salz",
        "amount": 1,
        "unit": "PINCH"
      },
      {
        "name": "Eier",
        "amount": 2,
        "unit": "PIECE"
      },
      {
        "name": "(frische) Hefewürfel",
        "amount": 1,
        "unit": "PACK"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 4,
    "name": "Linsen mit Spätzle",
    "duration": 60,
    "categories": [],
    "instructions": [
      "Die (trockenen) Linsen nach Packungsanleitung kochen. z.B. 3 Teile Wasser auf 1 Teil Linsen, 45 Minuten auf mittlerer Hitze kochen lassen, dabei möglichst nicht umrühren. Wer will kann auch noch Fleischbrühwürfel dazugeben.",
      "Wenn noch ca. 20 Minuten übrig sind, die Zwiebel und den Knoblauch in der Butter leicht anbraten. Dann unter Rühren das Mehl dazugeben und etwas anbräunen. Mit 1-2 EL Tomatenmark vermischen, nochmal kurz anbraten und dann zu den Linsen geben.",
      "Die Spätzle rechtzeitig nach Packungsanleitung kochen, die Linsen abtropfen lassen, dann mit Pfeffer, Salz und ggf. Essig abschmecken. Die Würstchen können entweder am Ende in den Linsen direkt mitgewärmt werden oder seperat gekocht werden."
    ],
    "ingredients": [
      {
        "name": "Linsen",
        "amount": 400,
        "unit": "GRAMS"
      },
      {
        "name": "Zwiebel",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Knoblauchzehe",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Spätzle",
        "amount": 200,
        "unit": "GRAMS"
      },
      {
        "name": "Salz",
        "amount": 1,
        "unit": "PINCH"
      },
      {
        "name": "Saitenwürstle",
        "amount": 4,
        "unit": "PIECE"
      },
      {
        "name": "Essig",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Tomatenmark",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Mehl",
        "amount": 2,
        "unit": "TABLESPOON"
      },
      {
        "name": "Butter",
        "amount": 20,
        "unit": "GRAMS"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "Milchreis nach Uromas Art",
    "duration": 60,
    "categories": [],
    "instructions": [
      "Den Reis nach Packungsanleitung kochen, währenddessen die Eier trennen und das Eigelb mit der Butter und dem Zucker schaumig aufschlagen. Außerdem getrennt das Eiweiß aufschlagen.",
      "Den fertigen Reis zunächst mit der Eigelb-Mischung und dem Zitronensaft vermengen, dann das aufgeschlagene Eiweiß unterheben. Alles in eine ofenfeste Form geben und ~45 Minuten bei 150° Ober-Unterhitze backen."
    ],
    "ingredients": [
      {
        "name": "Milchreis",
        "amount": 200,
        "unit": "GRAMS"
      },
      {
        "name": "Milch",
        "amount": 500,
        "unit": "MILLILITERS"
      },
      {
        "name": "Butter",
        "amount": 30,
        "unit": "GRAMS"
      },
      {
        "name": "Zucker ( / Honig / Agvendicksaft)",
        "amount": 5,
        "unit": "TABLESPOON"
      },
      {
        "name": "Eier",
        "amount": 2,
        "unit": "PIECE"
      },
      {
        "name": "Zitronensaft oder Vanillezucker",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 4,
    "name": "Mit Tomatenpesto gefülltes Huhn mit Alfredo Nudeln",
    "duration": 60,
    "categories": [],
    "instructions": [
      "Eine Tasche in die Hühnerbrüste schneiden und jeweils mit 2 klein geschnittenen Knoblauchzehen und einem Teelöffel Pesto füllen. Mit etwas Öl übergießen und mit Salz, Pfeffer, getrocknetem Basilikum und Knoblauchpulver würzen.",
      "Die so vorbereiteten Hühnerbrüste in einen Metalltiegel (oder einfach ein Backblech) geben und bei 200°C für 30 Minuten backen. Diese werden dabei einiges an Flüssigkeit abgeben.",
      "Während das Huhn backt, die Nudeln nach Packungsanleitung gar kochen. Währenddessen in einem großen Topf / einer tiefen Pfanne die Butter mit der Milch langam zum köcheln bringen.",
      "Den Käse / Parmesan zum köchelnden Milch-Butter-Gemisch hinzufügen und zusammen aufkochen. Kochen lassen, bis die Sauße die Rückseite eines Löffels überzieht. Die Temperatur verringern und warten bis die Nudeln fertig sind.",
      "Die fertig gekochten Nudeln nach dem Abtropfen in die Alfredosoße geben und vermengen. (Wenn die Soße noch zu flüssig ist, einfach etwas länger köcheln lassen)",
      "Das Huhn vor dem Verzehr ein paar Minuten ruhen lassen, sonst ist es noch zu heiß."
    ],
    "ingredients": [
      {
        "name": "Hühnerbrust",
        "amount": 4,
        "unit": "PIECE"
      },
      {
        "name": "Knoblauch",
        "amount": 8,
        "unit": "PIECES"
      },
      {
        "name": "Tomatenpesto",
        "amount": 1,
        "unit": "JAR"
      },
      {
        "name": "Schlagsahne (36+% Fett)",
        "amount": 250,
        "unit": "GRAMS"
      },
      {
        "name": "Vollmilch",
        "amount": 250,
        "unit": "MILLILITRE"
      },
      {
        "name": "Pecorino Romano Käse (Parmesan)",
        "amount": 1.5,
        "unit": "CUP"
      },
      {
        "name": "Butter",
        "amount": 2,
        "unit": "TEASPOON"
      },
      {
        "name": "Olivenöl",
        "amount": 2,
        "unit": "TEASPOON"
      },
      {
        "name": "Nudeln (Linguine (flache Spaghetti) o.ä.)",
        "amount": 0.5,
        "unit": "PACK"
      },
      {
        "name": "Salz, Pfeffer, getrockneter Basilikum, Knoblauchpulver",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 4,
    "name": "Nudelauflauf à la Carbonara",
    "duration": 30,
    "categories": [],
    "instructions": [
			"Zwei EL Sahne beiseite nehmen, diese brauchen wir am Ende.",
      "Die Nudeln mit allen Zutaten bis einschließlich zur Gemüsebrühe in einen Schnellkochtopf (4l) geben und alles gut miteinander vermischen.",
			"Den Tops auf höchster Stufe erhitzen bis der Schnellgarbereich erreicht ist.",
			"Den Herd ausschalten aber den Topf 4 Minuten auf der noch heißen Herdplatte stehen lassen.",
			"Den Druck ablassen (ggf unter fließendem Wasser) und nochmal alles miteinander vermengen.",
			"Die Eier mit der vorher beiseite gelegten Sahne verrühren und zur Nudelmasse geben. Den Topf nochmal auf den Herd stellen und die Eier stocken lassen (ggf den Herd nochmals einschlaten).",
			"Die Nudeln mit Pfeffer würzen und vor dem Servieren mit dem Parmesan vermengen."
    ],
    "ingredients": [
      {
        "name": "Pasta (z.B. Farfalle)",
        "amount": 250,
        "unit": "GRAMS"
      },
      {
        "name": "Knoblauch",
        "amount": 2,
        "unit": "PIECES"
      },
      {
        "name": "Zwiebel, in Würfeln",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Schlagsahne",
        "amount": 250,
        "unit": "MILLILITRE"
      },
      {
        "name": "Speckwürfel",
        "amount": 200,
        "unit": "GRAMS"
      },
      {
        "name": "kräftige Gemüsebrühe",
        "amount": 300,
        "unit": "MILLILITRE"
      },
      {
        "name": "Parmesan",
        "amount": 100,
        "unit": "GRAMS"
      },
      {
        "name": "Eier",
        "amount": 2,
        "unit": "PIECES"
      },
      {
        "name": "Pfeffer",
        "amount": null,
        "unit": "NONE"
      }
    ]
  }
]
