[
  {
    "id": "",
    "defaultGroupsize": 4,
    "name": "Spaghetti Bolognese",
    "duration": 30,
    "categories": [],
    "instructions": [
      "Eine tiefe Pfanne wird empfohlen. Zwiebeln kleinwürfeln und in Öl ein wenig anbraten. Das Hackfleisch dazugeben und schön anbraten.",
      "Mit Pfeffer, Salz, Pizzegewürz (oder eben andere Kräuter wie Basilikum, Majoran, etc.) würzen und dann mit den diversen Formen der Tomaten und etwas Wasser gut zusammenrühren.",
      "Nun die Nudeln aufsetzen, so dass die Soße auf mittlerer Hitze gut durchziehen kann. Fertig.",
      "Die Tomatensachen können nach Lust und Verfügbarkeit variiert werden. Geheimtipp: Zum Würzen etwas Worchester Soße nutzen."
    ],
    "ingredients": [
      {
        "name": "Zwiebeln",
        "amount": {
          "min": 1,
          "max": 2
        },
        "unit": "PIECE"
      },
      {
        "name": "(Rinder) Hackfleisch",
        "amount": 500,
        "unit": "GRAMS"
      },
      {
        "name": "Tomatenmark",
        "amount": 0.5,
        "unit": "TUBE"
      },
      {
        "name": "Passierte Tomaten",
        "amount": 1,
        "unit": "PACK"
      },
      {
        "name": "Gehackte Tomaten",
        "amount": 1,
        "unit": "CAN"
      },
      {
        "name": "Spaghetti",
        "amount": 0.5,
        "unit": "PACK"
      },
      {
        "name": "geribener Käse/Parmesan (nach Belieben)",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "Pfannkuchen",
    "duration": 10,
    "categories": [],
    "instructions": [
      "Die Eier mit dem Zucker cremig aufschlagen, dann mit der Milch verrühren. Nun Salz, Mehl und Backpulver dazugeben und alles zu einem glatten Teig rühren.",
      "Danach den Teig für ca. 15 Minuten ruhen lassen, da das Mehl noch ausquillt. Dann 1-2 große Schöpfkellen Teig in eine auf mittlere Hitze erhitzte, beschichtete Pfanne geben.",
      "Nach ca. 2 Minuten bilden sich kleine Bläschen, dann den Pfannkuchen einmal wenden und von der anderen Seite schön goldbraun ausbacken. "
    ],
    "ingredients": [
      {
        "name": "Eier",
        "amount": 4,
        "unit": "PIECE"
      },
      {
        "name": "Zucker",
        "amount": 2,
        "unit": "TABLESPOON"
      },
      {
        "name": "Milch",
        "amount": 400,
        "unit": "MILLILITER"
      },
      {
        "name": "Salz",
        "amount": 1,
        "unit": "PINCH"
      },
      {
        "name": "Mehl",
        "amount": 200,
        "unit": "GRAMS"
      },
      {
        "name": "Backpulver",
        "amount": 1,
        "unit": "MSP"
      },
      {
        "name": "Öl, zum Braten",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "Kartoffel-gemüsesuppe mit opt. Wursteinlage",
    "duration": 30,
    "categories": [],
    "instructions": [
      "Kartoffeln schälen, vierteln oder kleiner (je kleiner, desto schneller werden sie gar!). Weiteres Gemüse (z.B. Karotten, Lauch, Sellerie, Zwiebeln, etc), kleinschneiden und ebenfalls dazu geben.",
      "Mit Wasser bis knapp über die Füllhöhe auffüllen, das ganze mit Gemüsebrühe würzen und aufkochen, bis die Kartoffeln weich sind (ca. 20 Minuten). Alles mit dem Pürierstab passieren.",
      "Die Wurst in Scheiben schneiden, zur Suppe dazugeben und ein paar Minuten warm werden lassen. Mit Gemüsebrühe, Salz, Pfeffer, Maggi, etc. abschmecken.",
      "Das Rezept ist sehr flexibel, man kann das Gemüse variieren, z.B. mehr Karotten, Kürbis, Pastinaken, etc."
    ],
    "ingredients": [
      {
        "name": "Kartoffeln (mehlig)",
        "amount": 500,
        "unit": "GRAMS"
      },
      {
        "name": "Gemüse, div. (z.B. Karotten, Lauch, Sellerie, etc)",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Gemüsebrühe",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Wurst (z.B. Cabanossi, Krakauer, Bauernmettwurst)",
        "amount": 100,
        "unit": "GRAMS"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 2,
    "name": "UMAMI-Burger",
    "duration": 30,
    "categories": [],
    "instructions": [
      "Die Zwiebel, den Knoblauch und die Ingwerknolle kleinhacken (alternativ nur mit Ingwer würzen). Das Hackfleisch mit der Zwiebel, dem Ingwer, dem Eigelb, dem Steakpfeffer, der Soja Sauße und dem Parmesan zusammen in eine Schüssel geben und miteinander vermengen.",
      "Aus der resultierenden Masse zwei Burgerpattys formen (alternativ zu kompakten Kugeln rollen und dann in der Pfanne klein drücken).",
      "Aus der Tomate zwei große Scheiben herausschneiden und diese mit dem Zucker/Honig/Agavendicksaft großzügig bestreichen. Mit der Zuckerseite nach unten in der Pfanne auf mittlerer Hitze (mit Öl) etwas anbraten.",
      "Währenddessen die Fleischpatties in der Pfanne anbraten. Nicht zu scharf, lieber etwas Zeit lassen. Die Tomate gelegentlich wenden und rechtzeitig aus der Pfanne nehmen, sonst verbrennt man sich die Zunge.",
      "Empfehlung: Brioche Brötchen als Burgerbrötchen nutzen. Diese in der Pfanne mit anbraten.",
      "Die Unterseite der Brötchen mit Kresse belegen, darauf die Karamelisierte Tomatenscheibe und darauf dann das Fleisch. Wer es mag kann darauf dann noch dünne Gewürzgurkenscheiben legen. Mit dem oberen Teil des Brötchens beenden.",
      "Wichtig: keine sonstigen Soßen oder sonst irgendwas auf den Bruger mit drauf!"
    ],
    "ingredients": [
      {
        "name": "mageres Rinderhackfleisch",
        "amount": 250,
        "unit": "GRAMS"
      },
      {
        "name": "Zwiebel",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Ingwer",
        "amount": 0.5,
        "unit": "PIECE"
      },
      {
        "name": "große Tomate (Fleischtomate)",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Eigelb",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Parmesan, gerieben",
        "amount": {
          "min": 1.5,
          "max": 2
        },
        "unit": "TABLESPOON"
      },
      {
        "name": "Soja Sauße",
        "amount": 1,
        "unit": "TABLESPOON"
      },
      {
        "name": "Knoblauch",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Brunnen-/Radieschenkresse",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Knoblauch",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "Gewürzgurken",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Soja Sauße",
        "amount": 1.5,
        "unit": "TABLESPOON"
      },
      {
        "name": "Steakpfeffer",
        "amount": 1,
        "unit": "TABLESPOON"
      },
      {
        "name": "Zucker/Honig/Agavendicksaft",
        "amount": null,
        "unit": "NONE"
      },
      {
        "name": "Olivenöl zum Anbraten",
        "amount": null,
        "unit": "NONE"
      }
    ]
  },
  {
    "id": "",
    "defaultGroupsize": 6,
    "name": "Brioche (Burger-)Brötchen",
    "duration": 60,
    "categories": [],
    "instructions": [
      "Die Milch mit der Butter und dem Zucker in einem Topf leicht erwärmen, so dass die Butter schmilzt (nicht über 35°C werden lassen, also handwarm. Wenn sie doch wärmer wird, abkühlen lassen bevor es mit der Hefe vermischt wird).",
      "Die Hefe, die Hälfte des Mehls, das Salz und die Milch-Butter-Zucker Mischung in einer Schüssel zusammenmischen und geschmeidig verbinden. Entweder mit den Fingern oder mit dem Rührgerät.",
      "Das Ei in einer kleinen Schüssel verrühren und ungefähr die Hälfte davon in die große Schüssel dazu geben. Dann nach und nach mit dem restlichen Mehl vermischen.",
      "Den Teig jetzt 10-15 Minuten kräftig durchkneten, bis er nicht mehr klebrig ist sondern eher glatt und geschmeidig. Den Teig in 6 Teile aufteilen (ca. 80-100g pro Brötchen), in eine Kugel formen und auf einem Backrost mit Backpapier auslegen.",
      "Die Brötchen 30 Minuten an einem warmen Ort gehen lassen.",
      "Nach Belieben: Mit dem restlichen Ei bestreichen und mit Sesam bestreuen. 12-15 Minuten bei 200° Ober-Unterhitze im vorgeheizten Backofen backen."
    ],
    "ingredients": [
      {
        "name": "Mehl",
        "amount": 330,
        "unit": "GRAMS"
      },
      {
        "name": "Milch (3,5% oder mehr)",
        "amount": 150,
        "unit": "MILLILITER"
      },
      {
        "name": "Butter",
        "amount": 40,
        "unit": "GRAMS"
      },
      {
        "name": "Zucker",
        "amount": 15,
        "unit": "GRAMS"
      },
      {
        "name": "Salz",
        "amount": 5,
        "unit": "GRAMS"
      },
      {
        "name": "Ei",
        "amount": 1,
        "unit": "PIECE"
      },
      {
        "name": "(frische) Hefewürfel",
        "amount": 0.5,
        "unit": "PACK"
      },
      {
        "name": "(Sesam)",
        "amount": null,
        "unit": "NONE",
        "optional": true
      }
    ]
  }
]